# SpotSlopeSlopeRepresentation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotSlopeSlopeRepresentation Property
ParameterTypeId Class See Also
---
"Slope Representation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotSlopeSlopeRepresentation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotSlopeSlopeRepresentation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotSlopeSlopeRepresentation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace